{"intents":[
   {"tag":"greeting",
   "pattern": ["Hi", "Hello", "Is anyone there?", "Hey", "Hy", "Hay","Hii","It's nice to meet you","Good to see you","What's up"],
   "response":["Hello,I'm here to assist you", "Hi,I'm here to assist you", "Hey there,I'm here to assist you","Hy,I'm here to assist you"]},
   {"tag":"goodbye",
   "pattern": ["Bye", "See you later", "Good bye", "Goodbye","adios","ciao","bye-bye","Have a good day","Take care"],
   "response":["Bye! Come back again", "Bye! see you later", "Have a nice day","bye,see you soon","bye! good to see you","Bye! It's great to meet you","Bye-bye! It's great to meet you"]}, 
   {"tag":"bank details",
    "pattern":["what is bank","basic idea about bank","what is meant by bank","what is the basic knowledge about bank","what is the  basic need of bank","how can i use bank","Bank","Tell me about bank","Why we use bank"],
    "response":["A bank is a financial institution that is licensed to accept checking and savings deposits and make loans. Banks also provide related services such as individual retirement accounts (IRAs), certificates of deposit (CDs), currency exchange, and safe deposit boxes"]},
    {"tag":"create bank account",
    "pattern":["how to create abank account","create abank account","how should i create my bank account","Bank account creation","Bank account","How can i create bank account","creation of bank account"],
    "response":["go to bank,fill the  bank account application,added to adharcard xerox and pan card xerox,linked with phone number"]},
   {"tag":"thanks",
   "pattern":["Thanks", "Thank you", "That's helpful", "Thanks for the help","Tq","Tnx","Ok","Thankyou"], 
   "response":["Happy to help any time", "My pleasure", "You're most welcome","You're most welcome","Most welcome","I'm here help you any time"]}, 
   {"tag":"about",
   "pattern":["Who are you?", "what are you?","what you are?","Tell me about you?","I want to know about you?","Tell me about yourself","What about you"],
   "response":["Hi,I'm V", "Your bot assistant", "I'm V, an Artificial Intelligence Bot","I'm your assistant bot","i'm V! your assistant bot"]},
   {"tag":"Know",
   "pattern":["How are you","How areyou","Howare you","how are you","how areyou"],
   "response":["I'm fine,I think you also doing good"]}, 
   {"tag":"Name",
   "pattern":["What is your name", "What should i call you", "Whats your name","What's your name","Your name please","what can i call you","May i know your name"],
   "response":["You call me V", "I'm V!", "Just call me as V"]},
   {"tag":"help",
   "pattern":["Could you help me", "give me a hand please", "Can you help me", "What can you do for me","I need help"],                
   "response":["Tell me how can assist you", "Tell me your problem", "Yes sure!, How can I support you"]},                        
   {"tag":"Money processing",
   "pattern":["Why my money is in processing?","Money processing","My money is in proceesing,When will i get my money back?","I have a problem about money processing?","Money processing"],
    "response":["ok! You are facing a similar problem, May your money will credit after 1 to 3 working days,After! again you are facing same problem contact this number ****"]},
    {"tag":"Negative balance",
    "pattern":["why i have negative balance in my account bank account?","I have negative balance in my account","Why is there money missing from my bank account?","When will I get negative balance in my account"],
    "response":["In any bank account,you should maintain minimum balance according to the type of bank account,while check ones your bank balance and maintain minimum balance from now onwards","In any bank account,you should maintain minimum balance according to the type of bank account,while check ones your bank balance and maintain minimum balance from now onwards","In any bank account,you should maintain minimum balance according to the type of bank account,while check ones your bank balance and maintain minimum balance from now onwards","You get negative balance when you dont have minimum balance in corresponding bank account"]},
    {"tag":"Forget password",
    "pattern":["How can I reset my password?","I forget my ATM pin", "How can I regain my ATM password?","How can I change my password?","forget password","password forget"],
    "response":["Go near by ATM center or Bank,swipe ATM card in ATM machine,select option 'change password',Enter your old pin,change your pin","Go to your corresponding bank","Go near by ATM center or Bank,swipe ATM card in ATM machine,select option 'change password',Enter your old pin,change your pin"]},
    {"tag":"bank account issue",
    "pattern":["Why i can't login into online banking","Why I'am unable to login to online banking","Why it is still not working","I have joint account with someone who died.what happens now","What are the reasons for bank account failure","Why is my bank account frozen","Account number error"], 
    "response":["Check your bank service status","Check your credentials or check your network connection","kindly contact your bank","It depends on the account aggrement and state law","Bad loans or Funding issues or asset or liability or Mismatching or Regularity issues","Banks may freeze bank accounts,if they suspect illegal activity","Occurs when the payment instruction reaches a bank but the account doesnt exsist"]},
    {"tag":"automatic logout",
    "pattern":["How do i fix automatic logout?","Why do banks automatically logout?","Why isn't it letting me log into my online banking","Why it is being automatically logout?","how can i logout from my account?"],
    "response":["By clearing browser cookies or Check active sessions or Enable autologin or Disable ad blocker or By check suspicious browser extensions","As a security measure,most banks will automatically timeout after a period of inactivity but if you walk away from your computer,Espicially in a public place,logging out keeps someone from viewing your account information while your computer left unattented","Ensure you are using the correct website perhaps the reason that you can't log into your online banking because your calling for a 'phishing scam'","When there is inactivity in your bank account for a set amount of time "]},
    {"tag":"password reset",
    "pattern":["i want to reset my ATM password","how to reset my ATM password","ATM password reset","ATM reset password","Account number error"],
    "response":["Go near by ATM center or Bank,swipe ATM card in ATM machine,select option 'change password',Enter your old pin,change your pin"]},
    {"tag":"i lost my bank book",
    "pattern":["I lost my bank book","my bank book was lost","how can i get the new bank book","my bank book was theght"],
    "response":["first! go to the bank the apply for new bank book."]},
    {"tag":"ATM pin change",
    "pattern": ["how to change my ATM pin", "how can i change my atm pin","How do i change  my pin","is there any limit to change my ATM pin","what is require to change my pin","How many times i can change my ATM pin"],
    "response":["Go to near ATM center,insert your atm card,click on the pin change option,enter your old pin,then enter the new pin two times to confirm your new pin","you need to required ATM card","you need to your old pin","there is no set limit for the number of times you can go for an ATM card pin change"]},
    {"tag":"loan types",
    "pattern": ["how many type of loans are available","what types of loans are there","what are the loans","what kinds of loans of bank","how many  types of loans are available in bank","what are the loan types","How many loans are there"],
    "response":["personal loan ,educational loan,home loan,gold loan,loan against property,vehicles loan,bussiness loan"]},
    {"tag":"loan description",
    "pattern":["what is meant by loan","what is personal loan","what is meant by personal loan","tell me about personal loan","what do you mean by personal loan","detailed information on personal loan","explain about personal loan"],
    "response":["Definition of loan can be described as a property, money, or other material goods that is given to another party in exchange for future repayment of the loan value plus interest and other finance charges","A personal loan is money you borrow from a bank or other financial institution with a set repayment period and consistent monthly payments. Most personal loans are unsecured, so you won't have to put down collateral to borrow the money"]},
    {"tag":"loan",
    "pattern":["what is meant by educational loan","what is educational loan","tell me about educational loan","what do you mean by educational loan","detailed information on educational loan","explain about educational loan","education loan"],
    "response":["An education loan is a sum of money borrowed to finance post-secondary education or higher education-related expenses. Education loans are intended to cover the cost of tuition, books and supplies, and living expenses while the borrower is in the process of pursuing a degree."]},
    {"tag":"loan describe",
    "pattern":["what is meant by home loan","what is home loan","tell me about home loan","what do you mean by home loan","detailed information on home loan","explain about home loan"],
    "response":["A home loan is an amount an individual borrows from a financial institution such as a housing finance company to buy a new or a resale home, construct a home or renovate or extend an existing one."]},
    {"tag":"loans",
    "pattern":["what is meant by gold loan","what is gold loan","tell me about gold loan","what do you mean by gold loan","detailed information on gold loan","explain about gold loan"],
    "response":["Gold loan (also called loan against gold) is a secured loan taken by the borrower from a lender by pledging their gold articles (within a range of 18-24 carats) as collateral. The loan amount provided is a certain percentage of the gold, typically upto 80%, based on the current market value and quality of gold."]},
    {"tag":"about loan",
    "pattern":["what is meant by  loan  against property ","what is loan against property","tell me about loan against property","what do you mean by loan against property","detailed information on loan against property","explain about loan against property"],
    "response":["As the name says it all, loan against property is the loan you get from the bank against the mortgage of your property. This type of loan comes under the category of secured loan. The security in this case is the property of the borrower"]},
    {"tag":"vehicle loan",
    "pattern":["what is meant by vehicles loan","what is vehicles loan","tell me about vehicles loan","what do you mean by vehicles loan","detailed information on vehicles loan","explain about vehicles loan"],
    "response":["A Vehicle Loan is a loan that allows you to purchase two and four wheelers for personal use. Typically, the lender loans the money (making a direct payment to the dealer on the buyer's behalf) while the buyer must repay the loan in Equated Monthly Instalments (EMIs) over a specific tenure at a specific interest rate."]},
    {"tag":"bussiness loan",
    "pattern":["what is meant by bussiness loan","what is bussiness loan","tell me about bussiness loan","what do you mean by bussiness loan","detailed information on bussiness loan","explain about bussiness loan"],
    "response":["A business loan is a loan specifically intended for business purposes. As with all loans, it involves the creation of a debt, which will be repaid with added interest."]},
    {"tag":"interested rate of loans",
    "pattern":["how much interest rate in gold loan","what is the interest rate of gold loan in present year","what is the interest rate of gold loan","may i know the interest rate of gold loan","gold loan interest rate","what is the interest percentage of gold loan"],
    "response":["the average interest rate of gold loan in all banks will be 9%(percentage)"]},
    {"tag":"interest rate",
    "pattern":["how much interest rate in home loan","what is the interest rate of home loan in present year","what is the interest rate of home loan","may i know the interest rate of home loan","home loan interest rate","what is the interest percentage of home loan"],
    "response":["the average interest rate of home loan in all banks will be 7%(percentage)"]},
    {"tag":"loan interest",
    "pattern":["how much interest rate in vehicle loan","what is the interest rate of vehicle loan in present year","what is the interest rate of vehicle loan","may i know the interest rate of vechile loan","vehicle loan interest rate","what is the interest percentage of vehicle loan"],
    "response":["the average interest rate of vehicle loan in all banks will be 5%(percentage)"]},
    {"tag":"loans interest rate",
    "pattern":["how much interest rate in personal loan","what is the interest rate of personal loan in present year","what is the interest rate of personal loan","may i know the interest rate of personal loan","personal loan interest rate","what is the interest percentage of personal loan"],
    "response":["the average interest rate of personal loan in all banks will be 12%(percentage)"]},
    {"tag":"educational loan interest",
    "pattern":["how much interest rate in educational loan","what is the interest rate of educational loan in present year","what is the interest rate of educational loan","may i know the interest rate of educational loan","educational loan interest rate","what is the interest percentage of educational loan"],
    "response":["the average interest rate of educational loan in all banks will be 7%(percentage)"]},
    {"tag":"bussiness loan interest",
    "pattern":["how much interest rate in bussiness loan","what is the interest rate of bussiness loan in present year","what is the interest rate of bussiness loan","may i know the interest rate of bussiness loan","bussiness loan interest rate","what is the interest percentage of bussiness loan"],
    "response":["the average interest rate of bussiness loan in all banks will be 11.75% to 32%(percentage)"]},
    {"tag":"bank quary",
    "pattern":["is this safe to store money on bank?","is bank is the safest place to store the money?","is bank is the safest place to put the money?"],
    "response":["Yes! bank is the safest place to store ot put your money there is no prolem"]},
    {"tag":"beleave issu",
    "pattern":["is there any problem to store money at the bank","thre is any problem to store money on the bank","is bank is safest place to store money at the bank","can please tell me that is this good for saving money at the bank","is it safe to store money on bank","is there safe to store money at the bank"],
    "response":["Savings accounts are a safe place to keep your money because all deposits made by consumers are guaranteed by the Federal Deposit Insurance Corporation (FDIC) for bank accounts or the National Credit Union Administration (NCUA) for credit union accounts."]},
    {"tag":"geting more interest",
    "pattern":["how to get the more interest from the bank for my savings account?","more interest getting plans"],
    "response":["So, if you have some money set aside and want to earn a higher rate of interest without taking too much risk, consider these strategies.Switch to a high-interest savings account or Consider a rewards checking account or Take advantage of bank bonuses or Try a money market account or Check with your local credit union."]},
    {"tag":"types of bank accounts",
    "pattern":["how many types of bank accounts are there in the banking system","may i know the all types of bank accounts","types of bank accounts","bank account tyes","what are the types of accounts"],
    "response":["There are lot of accounts there on the current banking system they are 1.Savings account,2.Salary account,3.Fixed deposit account,4.Recurring deposit account,5.NRI accounts"]},
    {"tag":"current account",
    "pattern":["i want to know about current account","may i know about current account","current account"],
    "response":["A current account is a deposit account for traders, business owners, and entrepreneurs, who need to make and receive payments more often than others. These accounts hold more liquid deposits with no limit on the number of transactions per day. Current accounts allow overdraft facility, that is withdrawing more than what is currently available in the account. Also, unlike savings accounts, where you earn some interest, these are zero-interest bearing accounts. You need to maintain a minimum balance to be able to operate current accounts. "]},
    {"tag":"savings account ",
    "pattern":["what is savings account","savings account","may i know about savings account","what are the benifits of savings account","there is any use of savings account","what are the uses of savings account"],
    "response":["A savings bank account is a regular deposit account, where you earn a minimum rate of interest. Here, the number of transactions you can make each month is capped. Banks offer a variety of Savings Accounts based on the type of depositor, features of the product, age or purpose of holding the account, and so on."]},
    {"tag":"salary account",
    "pattern":["salary account","what is salary account","may i know about salary account","what are the advatages of salary account","be"],
    "response":["Among the different types of bank accounts, your salary account is the one you have opened as per the tie-up between your employer and the bank. This is the account, where salaries of every employee are credited to at the beginning of the pay cycle. Employees can pick their type of salary account based on the features they want. The bank, where you have a salary account, also maintains reimbursement accounts; this is where your allowances and reimbursements are credited to."]}, 
    {"tag":"Fixed deposit account",
    "pattern":["fixed deposit account","what is fixed deposit account","may i know about the fixed deposit account"],
    "response":["To park your funds and earn a decent rate of interest on it, there are different types of accounts like fixed deposits and recurring deposits. A fixed deposit (FD) account allows you to earn a fixed rate of interest for keeping a certain sum of money locked in for a given time, that is until the FD matures. FDs range between a maturity period of seven days to 10 years. The rate of interest you earn on FDs will vary depending on the tenure of the FD. Generally, you cannot withdraw money from an FD before it matures. Some banks offer a premature withdrawal facility. But in that case, the interest rate you earn is lower."]},
    {"tag":" Recurring deposit account",
    "pattern":["recurring deposit account","what is  recurring deposit account","may i know about recurring deposit account"],
    "response":["A recurring deposit (RD) has a fixed tenure. You need to invest a fixed sum of money in it regularly -- every month or once a quarter -- to earn interest. Unlike FDs, where you need to make a lump sum deposit, the sum you need to invest here is smaller and more frequent. You cannot change the tenure of the RD and the amount to be invested each month or quarter. Even in the case of RDs, you face a penalty in the form of a lower interest rate for premature withdrawal. The maturity period of an RD could range between six months to 10 years."]},
    {"tag":" NRI accounts",
    "pattern":["NRI accounts","what is  NRI accounts","may i know about NRI accounts"],
    "response":["There are different types of bank accounts for Indians or Indian-origin people living overseas. These accounts are called overseas accounts. They include two types of savings accounts and fixed deposits -- NRO or non-resident ordinary and NRE or non-resident external accounts. Banks also offer foreign currency non-resident fixed deposit accounts. Let us quickly see the various types of bank accounts for NRIs-"]},
    {"tag":"Bank investing",
   "pattern":["What is investing bank","Investing Bank","Bank investing","Why i invest money in bank"],
   "response":["An investment bank is a financial institution that acts as an intermediary in complex corporate transactions such as mergers and acquisitions. An initial public offering (IPO) refers to the process of offering shares of a private corporation to the public in a new stock issuance."]},
   {"tag":"consumer bank",
   "pattern":["What is consumer bank","consumer bank","what is consumer bank?"],
   "response":["Consumer bank is a new addition in the banking sector,such bank exist only in countries like U.S.A and Germany.This bank provides loans to their customer to buy T.V,Car,furniture etc.and give the option of easy payment through instalment"]},
   {"tag":"operate account",
   "pattern":["What are the different ways you can operate your accounts","Different ways to operate bank accounts","How many ways to operate bank accounts"],
   "response":["They are four types. 1,Internet banking. 2,Telephone or Mobile banking. 3,Branch or over the counter service. 4, ATM (Automated Teller Machine)"]},
   {"tag":"robot",
   "pattern":["are you a robot","robot"],
   "response":["Yes!I am robot"]},
   {"tag":"proble with bank",
   "pattern":["i have a proble with bank sever","why  bank server slow","i did'nt able to use the bank","i have some technical issue with bank server"],
   "response":["ok! it's not a proble it will become normal with in 24 hours"]
   },
   {"tag":"ATM card blocked",
   "pattern":["my atm card was blocked","why my atm card was blocked","my atm card was not working"],
   "response":["ok! please go to the bank apply for the new ATM card"]
   },
   {"tag":"bank account blocked",
   "pattern":["my bank account was blocked","my bank account was did not working properly","why my bank account was not working","my bank book was blocked","why my bank book was blocked"],
   "response":["login to your cooresponding banking website then enter your bank account number rise the proble.."]

   },
    {"tag":"loan limit",
    "pattern":["how much loan i will get from the bank","what is the loan limit of the bank","loan limit of the bank","maximum loan limit of the bank"],
    "response":["It will depending upon your cridit score and also your profile.."]

    },
    {"tag":"number of transactions",
    "pattern":["how many number of transations will do on any bank","in one day how many number of transations will be done","transation limit","how much transaction limit i have"],
    "response":["You will done 20 transations in a day..."]

    },
    {"tag":"debit card limit",
    "pattern":["what is the limit of debit card transactions","how many transactions can be done in one day","what is the limit of debit card transactions ","debit card transaction limit"],
    "response":["In one month you can able to do the maximum of 5 transactions"]
    },
    {"tag":"limit of money from ATM",
    "pattern":["how much money can be drawen from the ATM","what is the money limit of ATM","what is the maximum limit of the ATM","money limit of ATM macine","Money limit of ATM"],
    "response":["you can able to withdraw the maximum of 25 thousand rupess from the ATM..."]

    },
    {"tag":"debit of cda machine",
    "pattern":["how much money can be drawen from the cda machine","money limit of cda macine"],
    "response":["If you have the card you can able to wihtdraw the 2 lakhs from the CDA machine or else if you did not have the card you can withdraw the 49900 from the CDA machine"]
    },
    {"tag":"applying for debit card",
    "pattern":["how to apply debit card","how to aply atm card","what is the process of appling the debit card","what is the process of applying the debit card","process to applying for debit card","process of applying debit card"],
    "response":["first you need select the type of bank then open a bank account then choose the type of debit card then submit the form after wait for the call..."]
    },
   {"tag":"otp issue",
   "pattern":["I did not get any otp before ant transaction","my money has been withdrawn with out any otp","with out otp","otp was not getting","my maone was tranfored with out any getting otp"],
   "response":["Go your corresponding bank and check the transctions data and phone number link with bank account.."]
   },
   {"tag":"investment interest",
   "pattern":["what is the iterest rate of investment of any bank","if i put the money on the bank how much money i will get"],
   "response":["The average interest of one rupee per day depends on the interest rate offered by the bank or financial institution. If we assume an annual interest rate of 4%, the average interest on one rupee per day would be approximately 0.004 rupees per day, or 4 paise per day..."]
   },
   {"tag":"aplying for cridit card",
   "pattern":["how to apply the credit card","credit card appying process","what is the proess of apllying credit card","credit card applyingprocess"],
   "response":["Applying for a credit card usually involves the following steps:Research: Before you apply, do some research to find the credit card that best suits your needs. Consider the card's interest rate, annual fee, rewards program, and other benefits.Check your credit score: Your credit score is one of the key factors that credit card issuers consider when deciding whether to approve your application. Check your credit score to get an idea of where you stand.Gather your information: You'll need to provide personal information, including your name, address, social security number, and income, as well as details about your employment and housing situation.Fill out the application: You can apply for a credit card online or by filling out a paper application. Be sure to read the terms and conditions carefully before you apply.Submit your application: Once you've completed the application, submit it to the credit card issuer. You may receive an instant decision or you may have to wait a few days to hear back.Activate your card: Once you're approved for the credit card, you'll need to activate it before you can start using it. Follow the instructions provided by the issuer to activate your card.Remember, it's important to use credit cards responsibly and pay your bills on time to avoid accumulating debt and damaging your credit score."]
   },
   {"tag":"bank customer care number",
   "pattern":["customer care number of particular bank","what is the customer care number of a particular bank","customer care numbers","differnt bank customer care numbers"],
   "response":["1.HDFC bank           -->1860 267 1661",
               "2.state bank of india -->1800 180 1290",
               "3.Axis bank           -->1860 500 5555",
               "4.LIC bank            -->1800 419 0064",
               "5.canara bank         -->1800 425 0018",
               "6.Andhra bank         -->1800 425 1515",
               "7.Unioun bank         -->1800 208 2244",
               "8.india bank          -->1800 425 000000"]
   },
   {"tag":"ifsc codes",
   "pattern":["IFSC codes of particular bank","what is the IFSC code of particular bank","IFSC code","different types of banks IFSC codes"],
   "response":["1.SBI       --> SBIN0000721",
               "2.HDFC      --> HDFC0000909",
               "3.ICICI     --> ICIC0000236",
               "4.AXIS      --> UTID000034",
               "5.UNIOUN    --> UBIN0804321"]
   },
   {"tag":"fixed loan deposit",
    "pattern":["what is meant by fixed loan deposit","what is mean by fixed depoist","what is the basic knowledge about fixed deposit","what is basic information regarding to fixed deposit","what is the basic acknowledgement of fixed deposit"],
    "response":["it is asome  specific amount depoisted by  some specific period..."]
    }
    ]
    }